[
  {
    "id": "01",
    "title": "Fable of the Community",
    "date": "2020",
    "category": "Academic / Accommodation",
    "description": "Explored the geometric logic of urban living spaces and the interplay of light and shadow.",
    "details": [
      "In Taiwan, property owners commonly partition single apartment units into multiple smaller subdivisions to maximize rental yield.",
      "However, these modifications often lack holistic spatial planning, prioritizing unit quantity over spatial quality. Consequently, essential elements such as circulation, natural ventilation, and daylighting are compromised, leading to a significant decline in living standards.",
      "This design attempts to rediscover the quality of living and the possibility of community interaction while meeting the density requirements."
    ],
    "image": "assets/images/ProjectImage/Project_01.jpg",
    "gallery": [
      "assets/images/ProjectImage/Project_01_01.jpg",
      "assets/images/ProjectImage/Project_01_02.jpg",
      "assets/images/ProjectImage/Project_01_03.jpg",
      "assets/images/ProjectImage/Project_01_04.jpg"
    ],
    "link": "project-detail.html?id=01"
  },
  {
    "id": "02",
    "title": "In-Between Reading",
    "date": "2018",
    "category": "Academic / Special Library",
    "description": "A special library design project focused on the spatial experience of reading.",
    "details": [
      "Focused on the concept of 'In-Between', this project explores the spatial relationship between the reader, the book, and the urban environment.",
      "The design aims to create a sanctuary for knowledge within the chaotic urban fabric, using light and structural rhythm to guide the user's journey."
    ],
    "image": "assets/images/ProjectImage/Project_02.jpg",
    "gallery": [],
    "link": "project-detail.html?id=02"
  },
  {
    "id": "03",
    "title": "Project Post Pompidou",
    "date": "2019",
    "category": "Academic / Spatial Installation",
    "description": "A spatial installation project reinterpreting the structural logic of the Pompidou Centre.",
    "details": [
      "This project investigates the aesthetic of exposed structure and mechanical services, drawing inspiration from the Centre Pompidou.",
      "By creating an immersive spatial installation, it challenges the traditional boundaries between functional infrastructure and architectural space."
    ],
    "image": "assets/images/ProjectImage/Project_03.jpg",
    "gallery": [],
    "link": "project-detail.html?id=03"
  },
  {
    "id": "04",
    "title": "A Line Of Running Memories",
    "date": "2019",
    "category": "Academic / Community Infrastructure",
    "description": "Integrating public paths with community nodes to revitalize local history.",
    "details": [
      "A community infrastructure project that functions as a linear narrative of the site's collective memory.",
      "The design integrates pedestrian pathways with community nodes, fostering social interaction while preserving and highlighting historical traces of the neighborhood."
    ],
    "image": "assets/images/ProjectImage/Project_04.jpg",
    "gallery": [],
    "link": "project-detail.html?id=04"
  },
  {
    "id": "05",
    "title": "Working Palace",
    "date": "2018",
    "category": "Academic / Education",
    "description": "An educational facility design rethinking the 'palace' of learning.",
    "details": [
      "Rethinking the educational environment as a 'Working Palace', where learning is treated with the dignity of a civic institution.",
      "The layout promotes collaborative learning and flexible interactions, moving away from rigid classroom hierarchies."
    ],
    "image": "assets/images/ProjectImage/Project_05.jpg",
    "gallery": [],
    "link": "project-detail.html?id=05"
  },
  {
    "id": "06",
    "title": "Rapid City",
    "date": "2019",
    "category": "Academic / Accommodation",
    "description": "An accommodation project addressing rapid urbanization and housing needs.",
    "details": [
      "Addressing the challenges of rapid urbanization, this project proposes a high-density accommodation solution.",
      "It focuses on modularity and efficiency without sacrificing the quality of individual living spaces."
    ],
    "image": "assets/images/ProjectImage/Project_06.jpg",
    "gallery": [],
    "link": "project-detail.html?id=06"
  },
  {
    "id": "07",
    "title": "SparkGen-CostGen",
    "date": "2025",
    "category": "Professional / Programming",
    "description": "Decoupling Geometry and Material Data for Cost-Driven Modeling.",
    "details": [
      "The kernel of this function is reducing modeling effort for cost estimation.",
      "By decoupling geometry and material data, CostGen computes accurate building costs directly from a material database once the geometric model is defined.",
      "This enables real-time cost feedback without additional modeling workload, streamlining the BIM workflow from design to construction estimation."
    ],
    "image": "assets/images/ProjectImage/Project_07.jpg",
    "gallery": [],
    "link": "project-detail.html?id=07"
  },
  {
    "id": "08",
    "title": "Space Syntax Analysis",
    "date": "2024",
    "category": "Analysis / Research",
    "description": "Computational analysis of spatial configurations and human movement.",
    "details": [
      "Utilizing Space Syntax methodologies to analyze urban grids and building layouts.",
      "This research visualizes spatial integration and connectivity, providing data-driven insights for architectural decision-making."
    ],
    "image": "assets/images/ProjectImage/Project_08.jpg",
    "gallery": [],
    "link": "project-detail.html?id=08"
  }
]